Repository: archlinuxcn/repo
Catalog: downgrade/*.po
Languages: lt, nb, nn

source: error: $*
lt: klaida: $*
nb: feil: $*
nn: feil: $*

source: usage: downgrade [ -d <dir> ] [ -m <i686|x86_64> ] [ -a | -c ] [ -i ] [ -- ] <pkg> ... options: -d,--pkgdir set download directory (A.R.M. only), default is \`/tmp' -m,--arch set search architecture (A.R.M. only), default is determined by \`uname -m\` -a,--noarm don't search the A.R.M. when nothing's available in cache -c,--nocache don't look in cache, go directly to A.R.M. -i,--noinstalled don't show [installed] next to installed versions (speed up) -s,--nosudo don't use sudo, even when available
lt: naudojimas: downgrade [ -d <dir> ] [ -m <i686|x86_64> ] [ -a | -c ] [ -i ] [ -- ] <pkg> ... parinktys: -d,--pkgdir nustatyti parsiuntimo aplanką (tik A.R.M.), numatytasis yra \`/tmp' -m,--arch nustatyti paieškos architektūrą (tik A.R.M.), numatytoji nustatoma pagal \`uname -m\` -a,--noarm jei podėlyje nieko nerasta neieškoti A.R.M. -c,--nocache neieškoti podėlyje, eiti tiesiai prie A.R.M. -i,--noinstalled nerodyti [įdiegta] šalia įdiegtų versijų (greičiau) -s,--nosudo nenaudoti sudo, net jei galima
nb: bruk: downgrade [ -d <dir> ] [ -m <i686|x86_64> ] [ -a | -c ] [ -i ] [ -- ] <pkg> ... handlinger: -d,--pkgdir velg nedlastingsområde (bare for A.R.M.), standard er \`/tmp' -m,--arch velg arkitektur for søk (bare for A.R.M.), standard er bestemt av \`uname -m\` -a,--noarm ikke søk i A.R.M. hvis ingenting er funnet i mellomlagring -c,--nocache ikke let i mellomlagring, gå rett til A.R.M. -i,--noinstalled ikke vis [installert] ved installerte versjoner (raskere) -s,--nosudo ikke bruk sudo selv om det er tilgjengelig
nn: bruk: downgrade [ -d <dir> ] [ -m <i686|x86_64> ] [ -a | -c ] [ -i ] [ -- ] <pkg> ... handlinger: -d,--pkgdir vel nedlastingsområde (berre for A.R.M.), standard er \`/tmp' -m,--arch vel arkitektur for søk (berre for A.R.M.), standard er bestemt av \`uname -m\` -a,--noarm ikkje søk i A.R.M. dersom ingenting er funne i mellomlagring -c,--nocache ikkje leit i mellomlagring, gå rett til A.R.M. -i,--noinstalled ikkje vis [installert] ved installerte versjonar (raskare) -s,--nosudo ikkje bruk sudo sjølv om det er tilgjengeleg

source: please do not run downgrade as root; su/sudo will be used when needed
lt: nevykdykite „downgrade“ kaip root naudotojas; kai reikės su/sudo bus panaudota
nb: vennligst ikke kjør downgrade som superbruker; su/sudo vil bli brukt etter behov
nn: ikkje køyr downgrade som superbrukar; su/sudo vil bli brukt etter behov

source: $msg or [q]uit:
lt: $msg arba [i]šeikite:
nb: $msg eller [a]vslutt
nn: $msg eller [a]vslutt

source: q
lt: i
nb: a
nn: a

source: y
lt: t
nb: j
nn: j

source: $pack [installed]
lt: $pack [įdiegta]
nb: $pack [installert]
nn: $pack [installert]

source: could not install package $pkg
lt: paketo $pkg įdiegti nepavyko
nb: kunne ikke installere $pkg
nn: kunne ikkje installere $pkg

source: The following packages are available in your cache:
lt: Iš jūsų podėlio prieinami šie paketai:
nb: følgende pakker er tilgjengelige i mellomlagring
nn: følgjande pakkar er tilgjengelege i mellomlagring

source: please choose a version, [s]earch A.R.M
lt: pasirinkite versiją, [i]eškoti A.R.M
nb: vennligst velg en versjon, [s]øk A.R.M.
nn: vel ein versjon, [s]øk A.R.M.

source: please choose a version
lt: pasirinkite versiją
nb: vennligst velg en versjon
nn: vel ein versjon

source: s
lt: i

source: invalid choice.
lt: netinkamas pasirinkimas.
nb: ugyldig valg.
nn: ugyldig val.

source: $arch is invalid, must be 32 or 64
lt: $arch netinkama, turi būti 32 arba 64
nb: $arch er ugyldig, må være 32 eller 64

source: The following packages are available from the A.R.M.:
lt: Iš A.R.M. prieinami šie paketai :
nb: Følgende pakker er tilgjengelige fra A.R.M.:
nn: Følgjande pakkar er tilgjengelege frå A.R.M.:

source: unable to create $pkgdir
lt: nepavyko sukurti $pkgdir
nb: kan ikke opprette $pkgdir
nn: kan ikkje opprette $pkgdir

source: Add $pkg to IgnorePkg in $pacman_conf
lt: Pridėti „$pkg“ į IgnorePkg faile $pacman_conf
nb: Legg til $pkg til IgnorePkg i $pacman_conf
nn: Legg til $pkg til IgnorePkg i $pacman_conf

source: $arch is invalid, must be i686 or x86_64
nn: $arch er ugyldig, må vere i686 eller x86_64
